{"dt": "2020-03-06 16:34", "min_followers": 10, "min_stars": 15, "users": [["User", "nathvarun", "https://avatars2.githubusercontent.com/u/2167011?v=4", []], ["User", "aciidb0mb3r", "https://avatars0.githubusercontent.com/u/4136295?v=4", [["SwiftMQTT", "https://github.com/aciidb0mb3r/SwiftMQTT", "MQTT Client in pure swift ❤️", 212, "Swift"], ["Spawn", "https://github.com/aciidb0mb3r/Spawn", "Easily spawn new processes using Swift", 40, "Swift"], ["Swiflytics", "https://github.com/aciidb0mb3r/Swiflytics", "Live Google Analytics", 40, "Swift"], ["SwiftMarkupGen", "https://github.com/aciidb0mb3r/SwiftMarkupGen", "Swift Documentation Markup Template Generator", 38, "Swift"]]], ["User", "jogendra", "https://avatars2.githubusercontent.com/u/20956124?v=4", [["LoadingShimmer", "https://github.com/jogendra/LoadingShimmer", "An easy way to add a shimmering effect to any view with just one line of code. It is useful as an unobtrusive loading indicator.", 1065, "Swift"], ["BadgeHub", "https://github.com/jogendra/BadgeHub", "A way to quickly add a notification badge icon to any view. Make any UIView a full fledged animated notification center.", 481, "Swift"], ["example-ios-apps", "https://github.com/jogendra/example-ios-apps", " A curated list of Open Source example iOS apps developed in Swift. An amazing list for people who are beginners and learning ios development and for ios developers who need any example app or feature.", 300, "Swift"], ["phimpme-iOS", "https://github.com/jogendra/phimpme-iOS", "Phimp.me - Photo Image Editor and Sharing App. Phimp.me is a Photo App for iOS that aims to replace proprietary photo applications. It offers features such as taking photos, adding filters, editing images and uploading them to social networks.", 74, "Swift"], ["ds-algo-placement-resources", "https://github.com/jogendra/ds-algo-placement-resources", "A complete roadmap and resources for competitive programming for placement purpose.", 26, "Swift"], ["material-navigation-bar", "https://github.com/jogendra/material-navigation-bar", "Custom UINavigationBar with Google Material style for iOS, with very smooth animations", 19, "Swift"]]], ["User", "HarshilShah", "https://avatars2.githubusercontent.com/u/3503595?v=4", [["DeckTransition", "https://github.com/HarshilShah/DeckTransition", "A library to recreate the iOS Apple Music now playing transition", 2179, "Swift"], ["NotchKit", "https://github.com/HarshilShah/NotchKit", "A simple way to hide the notch on the iPhone X", 1840, "Swift"], ["Nocturnal", "https://github.com/HarshilShah/Nocturnal", "A simple macOS app to toggle dark mode with one click", 137, "Swift"], ["ActivityRings", "https://github.com/HarshilShah/ActivityRings", "An attempt to recreate the ring controls in Apple’s Activity app", 73, "Swift"], ["Watchface", "https://github.com/HarshilShah/Watchface", "My WWDC 2017 scholarship submission (Accepted)", 22, "Swift"]]], ["User", "VamshiIITBHU14", "https://avatars2.githubusercontent.com/u/21070922?v=4", [["DesignPatternsInSwift", "https://github.com/VamshiIITBHU14/DesignPatternsInSwift", "This repository contains all the code from my book 'Design Patterns in Swift', live at https://www.amazon.com/dp/B07FYXHBKZ. All code written in Swift4. Do give a star if you like the work.", 309, "Swift"], ["YouTubeClone", "https://github.com/VamshiIITBHU14/YouTubeClone", "This project is a clone of YouTube. But the main intention is to show how to write clean code, using proper MVC patterns and re-usable coding methodologies!", 146, "Swift"], ["FBChatClone", "https://github.com/VamshiIITBHU14/FBChatClone", "This project is a clone of FB Messenger .", 68, "Swift"], ["AppStoreClone", "https://github.com/VamshiIITBHU14/AppStoreClone", "This project is a clone of AppStore.", 63, "Swift"], ["ConcurrentDownloadsSwift3", "https://github.com/VamshiIITBHU14/ConcurrentDownloadsSwift3", "This project shows how to support concurrent downloads in swift3 via remote URLs && save them to your local directory && viewing them in offline mode && delete downloaded files. Download process is enhanced by Pause, Resume, Cancel, Progress bar controls.", 57, "Swift"], ["UberAnimation", "https://github.com/VamshiIITBHU14/UberAnimation", "Heyaa! This is an attempt to mimic the animation Uber and Facebook shows up as a Congratulatory Pop-up.  Looking at the attached GIF will give you a better idea of what this project covers. All written in Swift4. ", 54, "Swift"], ["VKLocalNotifications", "https://github.com/VamshiIITBHU14/VKLocalNotifications", "This project covers all the requried code to trigger UILocalNotifications. It can be helpful when you want to trigger a Push Notification when a user reaches a particular location. Does not need internet connection. ", 51, "Swift"], ["ExpandingCollectionView", "https://github.com/VamshiIITBHU14/ExpandingCollectionView", "This project covers adding a fancy expanding cell to UICollectionView, several auto layout-based labels, subtle parallax effects, and fading transitions to a standard Collection View. Written in Latest Swift Syntax. Converted from Swift2 to Swift3 (Source: https://www.raywenderlich.com)", 49, "Swift"], ["NLPSwift", "https://github.com/VamshiIITBHU14/NLPSwift", "NSLinguisticTagger provides a uniform interface to a variety of natural language processing functionality with support for many different languages and scripts. One can use this class to segment natural language text into paragraphs , sentences, or words and tag information  about those segments such as parts of speech, lexical class, lemma!", 46, "Swift"], ["BasketBallARKit", "https://github.com/VamshiIITBHU14/BasketBallARKit", "Hello Everyone, This project talks about basics of ARKit introduced by Apple in iOS11. Please note that ARKit is only capable wih devices which use A9, A10, A11 chips .It shows how to build a basic BasketBall app using ARKit. All written in Swift4.", 42, "Swift"], ["UIViewAnimationsHandbook", "https://github.com/VamshiIITBHU14/UIViewAnimationsHandbook", "This project takes up all the available UIView animations in Swift4. Each type animation added with an example and expected result in the form of GIF. A glimpse at README would give you a better idea. Do give a star if you like the work.", 42, "Swift"], ["PeekAndPopExtension", "https://github.com/VamshiIITBHU14/PeekAndPopExtension", "This project covers how to use 3D Touch to implement peek and pop using Custom Presentation Controllers. It also shows how to add a Today Extension to the project. All written in Swift4 using MVC pattern keeping code reusability and optimisation in mind.", 40, "Swift"], ["FacialContour", "https://github.com/VamshiIITBHU14/FacialContour", "The facial detection API allows us to not only detect faces & facial features but also check those faces for particular properties such as if a smile is present or eyes are open etc.  This is a simple app that recognizes a face in a photo and highlights it with a box. Also, it captures facial features like eyes, nose, lips, ears etc. All written i Swift4.", 40, "Swift"], ["CaffeToCoreML", "https://github.com/VamshiIITBHU14/CaffeToCoreML", "There are a lot of tutorials/ open source projects on how to use Vision and CoreML frameworks for Object Detection in real world using iOS apps using .mlmodels given by Apple. But seldom in reality, do we get a .mlmodel available suiting our use case.  Here, I took up a Caffe model for the Oxford 102 flower dataset, which was converted to CoreML model using coremltools python package.", 40, "Swift"], ["CoreDataSwift4", "https://github.com/VamshiIITBHU14/CoreDataSwift4", "This Project implements CoreData in Swift4 with a lot reduction in boilerplate code, using a UITableView with NSFetchedResultsController along with CRUD operations and Batch Updates", 38, "Swift"], ["CustomTabBarYouTube", "https://github.com/VamshiIITBHU14/CustomTabBarYouTube", "This project covers:  1) UICollectionViewFlowLayout with all the auto-layout constraints added programatically 2) How to build custom tab bar as seen in YouTube app 3) URL session integration to build feed for Home screen. All written in Latest Swift 3 syntax following MVC pattern, re-usable code methodologies, extensions etc.Converted from Swift2 (Source: https://www.letsbuildthatapp.com) to Swift3.", 35, "Swift"], ["HitAndScore", "https://github.com/VamshiIITBHU14/HitAndScore", "Sprite Kit is an exciting new framework for making 2D games that comes built-in to iOS. This project serves as an introduction to Sprite Kit where we build a small clone of Super Mario. Looking at the screenshots would give a better idea of what this project is about. All written in Swift4.", 32, "Swift"], ["VKTableView", "https://github.com/VamshiIITBHU14/VKTableView", "Hi! I was working on an app where I had to show information about 10-12 different entities and each entity details are to be shown in a UICollectionView. Thought of adding some fancy element and I came up with this project.  Would love your feedback. Please have a look at GIF attached to have a better idea of what I have come up with. Swift4. ", 31, "Swift"], ["BackgroundCoreData", "https://github.com/VamshiIITBHU14/BackgroundCoreData", "This Project looks like nothing in the UI but it covers an important and complex topic in CoreData , i.e, writing data to Database in background thread so that UI does not get blocked. It uses Swift4 with a lot of reduction in boilerplate code. It also implements using a single managedobjectcontext. ", 29, "Swift"], ["VKSentimentAnalysis", "https://github.com/VamshiIITBHU14/VKSentimentAnalysis", "This project is a demo on using CoreML framework for sentiment analysis of text. .mlmodel was developed from Scikit-learn Pipeline using coremltools python package. More details here : https://developer.apple.com/documentation/coreml/converting_trained_models_to_core_ml", 29, "Swift"], ["VKProgreePie", "https://github.com/VamshiIITBHU14/VKProgreePie", "his project is a plug and play - Customisable Live Rendering Radial Progress Indicator. All written in Swift4 latest syntax. Based on CoreAnimation framework. One can use either Storyboard or code to customise: 1) Background image of Indicator 2) Color of Indicator 3) Background colour of Indicator View 4) Show/ hide percent text 5) Customise Percent text label 6) Show/ hide background image of Indicator View", 29, "Swift"], ["VKStackImageView", "https://github.com/VamshiIITBHU14/VKStackImageView", "This project uses CoreAnimation to mimic StackView from iOS. I have used UIImageView as the Base View for Stack.", 28, "Swift"], ["VKProgressHud", "https://github.com/VamshiIITBHU14/VKProgressHud", "Hey All! As it is obvious from the GIF, this project is a LoadingIndicator based on CoreAnimation. ", 28, "Swift"], ["2DUICollectionViewSwift", "https://github.com/VamshiIITBHU14/2DUICollectionViewSwift", "A simple and elegant 2Dimensional UICollectionView which is most commonly used in ecommerce apps, music streaming apps etc. Easily customisable as per your requirements as it is designed keeping the superset requirement in mind. Developed in latest Swift syntax.", 28, "Swift"], ["expandableCellScroll", "https://github.com/VamshiIITBHU14/expandableCellScroll", "This project shows how to develop expandable cells in a UITableView. Each cell in turn consists of a UIScrollView and a UIImageView background. Data is fetched via an API call. Developed in Latest Swift syntax with Auto-layout constraints enabled.", 27, "Swift"], ["SwiftExpandingFlickr", "https://github.com/VamshiIITBHU14/SwiftExpandingFlickr", "This is a project showing how to fetch huge chunk of images via API and put them in a nice UICollectionView with parallax effect. It also covers adding a fancy expanding cell to UICollectionView, several auto layout-based labels, subtle parallax effects, and fading transitions to a standard Collection View. Written in Swift 3 Syntax.", 25, "Swift"], ["ImageSlider-Swift", "https://github.com/VamshiIITBHU14/ImageSlider-Swift", "A simple image slider in Swift with a switch to turn on/off auto slide.", 25, "Swift"], ["FakeFBWall", "https://github.com/VamshiIITBHU14/FakeFBWall", "This is a fun app to generate fake facebook wall. All the fields visible on the screen are editable. Screenshots attached for better understanding of the app. Code written in Swift 4.", 24, "Swift"], ["VerticalProgressScrollView", "https://github.com/VamshiIITBHU14/VerticalProgressScrollView", "This is a simple project showing UIScrollView with paging enabled and a straight forward Vertical Progress bar which animates as the user scrolls through the pages (number of pages are calculated dynamically based on content size). Written in latest Swift Syntax.", 23, "Swift"], ["CollectionViewSearchSwift", "https://github.com/VamshiIITBHU14/CollectionViewSearchSwift", "A simple project mainly focussing on Implementation of search in UICollectionView. Also lets you know about arranging UICollectionView Cells, their spacing, co-ordinates and arrangement based on different screen sizes.", 23, "Swift"], ["CoreDataSearch", "https://github.com/VamshiIITBHU14/CoreDataSearch", "This is a simple project which shows basics of Search on Core data . You can add, load, delete and make a search on the items added in a UICollectionView. Developed in Latest Swift 3 syntax.", 21, "Swift"], ["FlatPressButton", "https://github.com/VamshiIITBHU14/FlatPressButton", "Flat design clickable buttons. All code written in latest Swift4 syntax.", 19, "Swift"], ["FirebaseChatRoom", "https://github.com/VamshiIITBHU14/FirebaseChatRoom", "This application shows how to build (in Swift4) a simple Chat room where users can register, login, send messages to other users etc using Firebase. If you are a developer who has got an interesting idea but could not find a backend developer to take the idea to a product level, then do check out this project as an introductory course to Firebase. Trust me, Firebase is the best when it comes to Backend As Service.", 17, "Swift"]]], ["User", "riteshhgupta", "https://avatars3.githubusercontent.com/u/8268122?v=4", [["TagCellLayout", "https://github.com/riteshhgupta/TagCellLayout", "Made in Swift - Tag layout for UICollectionView supporting 3 types of alignments - Left || Centre || Right", 230, "Swift"], ["RGListKit", "https://github.com/riteshhgupta/RGListKit", "RGListKit is a Protocol & MVVM based framework to easily populate a UITableView or UICollectionView via single api.", 177, "Swift"]]], ["User", "ashishkakkad8", "https://avatars1.githubusercontent.com/u/6905345?v=4", [["AKSwiftSlideMenu", "https://github.com/ashishkakkad8/AKSwiftSlideMenu", "Slide Menu (Drawer) in Swift", 268, "Swift"]]], ["User", "hemangshah", "https://avatars3.githubusercontent.com/u/3313412?v=4", [["HHTabBarView", "https://github.com/hemangshah/HHTabBarView", "A lightweight customized tabbar view. 📌", 114, "Swift"], ["Workaholic", "https://github.com/hemangshah/Workaholic", "A Github's like work contribution timeline. 🤸🏻", 95, "Swift"], ["Zingle", "https://github.com/hemangshah/Zingle", "Zingle – An alert will display underneath your UINavigationBar 🎅", 93, "Swift"], ["HHFloatingView", "https://github.com/hemangshah/HHFloatingView", "An easy to use and setup floating view for your app. 🎡", 76, "Swift"], ["printer", "https://github.com/hemangshah/printer", "A fancy logger yet lightweight, and configurable. 🖨", 56, "Swift"], ["Datify", "https://github.com/hemangshah/Datify", "Easypeasy date functions. 🕛", 43, "Swift"], ["ClapsView", "https://github.com/hemangshah/ClapsView", "Implemented the functionality of Medium.com Claps. 👏", 29, "Swift"], ["Feelings", "https://github.com/hemangshah/Feelings", "Another rating view to share your feelings. 🎭", 22, "Swift"]]], ["User", "ehrishirajsharma", "https://avatars1.githubusercontent.com/u/35542790?v=4", [["Swiftness", "https://github.com/ehrishirajsharma/Swiftness", "A note-taking macOS app for penetration-testers.", 106, "Swift"]]], ["User", "kabiroberai", "https://avatars3.githubusercontent.com/u/12706786?v=4", []], ["User", "rudrankriyam", "https://avatars0.githubusercontent.com/u/30552772?v=4", [["LeetCode-in-Swift", "https://github.com/rudrankriyam/LeetCode-in-Swift", " My solutions to LeetCode problems written in Swift", 22, "Swift"]]], ["User", "kaunteya", "https://avatars1.githubusercontent.com/u/2352321?v=4", [["ProgressKit", "https://github.com/kaunteya/ProgressKit", "Progress Views for Cocoa", 490, "Swift"], ["LineX", "https://github.com/kaunteya/LineX", "Feature packed Xcode extension", 210, "Swift"], ["MacCacheCleaner", "https://github.com/kaunteya/MacCacheCleaner", "Mac cache cleaner", 104, "Swift"], ["InfoButton", "https://github.com/kaunteya/InfoButton", "Simple and Lightweight Information Button for macOS", 63, "Swift"], ["KSTabView", "https://github.com/kaunteya/KSTabView", "Simple and lightweight TabView for macOS", 50, "Swift"], ["APNSwift", "https://github.com/kaunteya/APNSwift", "HTTP/2 Swift APNS library for notification provider", 24, "Swift"], ["KSView", "https://github.com/kaunteya/KSView", "The missing NSView extension", 23, "Swift"]]], ["User", "nitin-agam", "https://avatars1.githubusercontent.com/u/12906999?v=4", [["SwiftAnimation", "https://github.com/nitin-agam/SwiftAnimation", "To learn the animation in Swift language.", 23, "Swift"]]], ["User", "RahulKatariya", "https://avatars3.githubusercontent.com/u/1857415?v=4", [["RKParallaxEffect", "https://github.com/RahulKatariya/RKParallaxEffect", "RKParallaxEffect is written in swift and provides API to create a parallax effect on UITableHeaderView with Full Screen option.", 123, "Swift"]]], ["User", "hitendradeveloper", "https://avatars3.githubusercontent.com/u/9197369?v=4", [["HSCenterSlider", "https://github.com/hitendradeveloper/HSCenterSlider", "Instagram Filters Slider. Easy to use double side center slider, that can show value in (A,B) Range.", 22, "Swift"]]], ["User", "PrashantMangukiya", "https://avatars2.githubusercontent.com/u/7823358?v=4", [["SwiftUIDemo", "https://github.com/PrashantMangukiya/SwiftUIDemo", "UI demo based on Swift 3, Xcode 8, iOS 10", 285, "Swift"], ["SwiftCoreImageFilter", "https://github.com/PrashantMangukiya/SwiftCoreImageFilter", "Core Image Filter demo app build using Swift 3, Xcode 8, and iOS 10.", 49, "Swift"], ["SwiftColorPicker", "https://github.com/PrashantMangukiya/SwiftColorPicker", "Color Picker using Swift 2, Xcode 7, iOS 9", 27, "Swift"], ["SwiftRSSReader", "https://github.com/PrashantMangukiya/SwiftRSSReader", "RSS Reader demo application build using Swift 2, Xcode 7, iOS 9", 21, "Swift"]]], ["User", "ashislaha", "https://avatars3.githubusercontent.com/u/10649284?v=4", [["Shape-Detection-in-AR", "https://github.com/ashislaha/Shape-Detection-in-AR", "Detect the shape of drawing objects (classes - line, triangle, rectangle, pentagon, Hexagon, circle) and draw in Augmented Reality.", 34, "Swift"], ["Route-Direction-in-AR", "https://github.com/ashislaha/Route-Direction-in-AR", "Adding the Feature \"Real World Path Direction\" by tapping on Map. GoogleMap will give us the direction to that location from user location then click on \"ARView\" & you will get the real-world path direction.  Also added \"Reachability\" for finding path in Google map.  -- Also added .mlmodel for car-detection. Initially trained the model using Convolutional Neural Network in TensorFlow, then convert the .h5 output into .mlmodel. Use it in the application. please check : https://github.com/ashislaha/CarDetection-Keras & https://github.com/ashislaha/CarDetection-iOS for more details how to train a model.  -- In ARFrame generates capturedImage which is the input to .mlmodel for detecting that car is present in the image or not.  -- This project combines both ARKit & CoreML.", 27, "Swift"], ["NLP-based-Store-assistant-with-AR", "https://github.com/ashislaha/NLP-based-Store-assistant-with-AR", " Let's create a generic template how AR(Augmented Reality) and NLP(Natural Language Processing) can be applied to Retail market to leverage the maximum benefits to customer like Offers, finding items in your shopping list, creating the shopping list using NLP based system, getting offers from assistant, showing the navigation path in AR etc", 19, "Swift"]]], ["User", "KiranJasvanee", "https://avatars0.githubusercontent.com/u/6015870?v=4", [["OnlyPictures", "https://github.com/KiranJasvanee/OnlyPictures", "A simple and flexible way to add source of overlapping circular pictures, currently supports horizontal overlapping or distant pictures with great layout flexibility.", 643, "Swift"], ["InfinityExpandableTableTree", "https://github.com/KiranJasvanee/InfinityExpandableTableTree", "Provides a tableview cells expansion (expanding cell area - subcells'), you can expand cells up to level ∞-1. Use Dynamic JSON Tree structure to initialise, or use static initialisers - Indexing/Swifty Closures.", 140, "Swift"], ["KJNavigationViewAnimation", "https://github.com/KiranJasvanee/KJNavigationViewAnimation", "Custom navigation view animation based on dragging & scrolling at TableView, CollectionView OR ScrollView", 63, "Swift"], ["KJCircularSlider", "https://github.com/KiranJasvanee/KJCircularSlider", "Slide circularly. Soon more extended version about to come!", 23, "Swift"]]], ["User", "ConfianceLabs", "https://avatars0.githubusercontent.com/u/20297380?v=4", [["CLabsImageSlider", "https://github.com/ConfianceLabs/CLabsImageSlider", "CLabsImageSlider is a image slider written in swift language.", 30, "Swift"]]], ["User", "dinarajas", "https://avatars2.githubusercontent.com/u/3694584?v=4", []], ["User", "palewar", "https://avatars3.githubusercontent.com/u/1754538?v=4", [["CS193P", "https://github.com/palewar/CS193P", "Code from CS193P iOS Development Swift Course", 196, "Swift"], ["Swift-Samples", "https://github.com/palewar/Swift-Samples", null, 23, "Swift"]]], ["User", "Akhilendra", "https://avatars3.githubusercontent.com/u/10877951?v=4", [["calenderAppiOS", "https://github.com/Akhilendra/calenderAppiOS", null, 40, "Swift"], ["photosAppiOS", "https://github.com/Akhilendra/photosAppiOS", "This is the source code for my photo gallery app tutorial on Youtube https://youtu.be/QS2mWk3fAWc", 27, "Swift"], ["Google-Map-Tutorial-iOS", "https://github.com/Akhilendra/Google-Map-Tutorial-iOS", null, 19, "Swift"]]], ["User", "abhimuralidharan", "https://avatars0.githubusercontent.com/u/9549201?v=4", [["StretchableTableViewHeader-Swift", "https://github.com/abhimuralidharan/StretchableTableViewHeader-Swift", "You might have seen a collapsable or stretchable tableview header in android. If you check the whatsapp profile/ group settings page , you can see this. If you are using Netflix app, you might have seen a zoom in effect in the tableview header as well. Well, if you ever wondered how to do this in iOS, I will give a simple solution.", 54, "Swift"], ["QRScanner", "https://github.com/abhimuralidharan/QRScanner", "QRScanner is a base level QR Code scanning application. It uses AVFoundation for scanning the code. Feel free to download and customize.", 35, "Swift"]]], ["User", "jriosdev", "https://avatars1.githubusercontent.com/u/38908155?v=4", [["iOSDropDown", "https://github.com/jriosdev/iOSDropDown", "Drop Down Menu for iOS With Search And Other Awesome Customisation", 291, "Swift"]]], ["User", "faisalazeez", "https://avatars0.githubusercontent.com/u/23516223?v=4", [["Video-Trim", "https://github.com/faisalazeez/Video-Trim", "Video trim with Range Slider.", 52, "Swift"], ["KFImageViewer", "https://github.com/faisalazeez/KFImageViewer", "KFImageViewer is a Kingfisher dependent Swift library providing customizable image slideshow.", 18, "Swift"]]], ["User", "angelvasa", "https://avatars3.githubusercontent.com/u/6593038?v=4", [["AVXCAssets-Generator", "https://github.com/angelvasa/AVXCAssets-Generator", "AVXCAssets Generator takes path for your assets images and creates appiconset and imageset for you in just one click", 323, "Swift"], ["AVLighterTableViewController", "https://github.com/angelvasa/AVLighterTableViewController", "LighterTableViewController Swift ", 42, "Swift"], ["AVLighterStickyHeaderView", "https://github.com/angelvasa/AVLighterStickyHeaderView", "Sticky header view inspired from android coordinate layout", 17, "Swift"]]], ["User", "ANSCoder", "https://avatars2.githubusercontent.com/u/19596311?v=4", [["ANLoader", "https://github.com/ANSCoder/ANLoader", "Create Swift loader in a single line with beautiful animation. 🏵", 35, "Swift"]]], ["User", "subinspathilettu", "https://avatars0.githubusercontent.com/u/13035902?v=4", [["SJSegmentedViewController", "https://github.com/subinspathilettu/SJSegmentedViewController", null, 296, "Swift"]]], ["User", "gokulgovind", "https://avatars3.githubusercontent.com/u/18026746?v=4", [["GLNotificationBar", "https://github.com/gokulgovind/GLNotificationBar", "GLNotificationBar is a ios10 style notification bar, can be used to handle push notification in active state. ", 307, "Swift"], ["GLInAppPurchase", "https://github.com/gokulgovind/GLInAppPurchase", "Tinder Style InApp Purchase Banner", 174, "Swift"], ["GLScratchCard", "https://github.com/gokulgovind/GLScratchCard", "I loved the way payments app's like Google pay and PhonePe used scratch card option to reward it's user. Hence with 💛 cloned the same scratch card effect for you guys out there", 54, "Swift"]]], ["User", "sauvikdolui", "https://avatars0.githubusercontent.com/u/14096115?v=4", [["SDStateTableView", "https://github.com/sauvikdolui/SDStateTableView", "A subclass of UITableView to show states like data load error, no data found, no internet connection easily.", 122, "Swift"], ["swiftlogger", "https://github.com/sauvikdolui/swiftlogger", "Medium Blog Post Project Repository", 66, "Swift"], ["NetworkStatusMonitorPart2", "https://github.com/sauvikdolui/NetworkStatusMonitorPart2", " Project for Medium Blog", 21, "Swift"], ["NetworkStatusMonitorPart1", "https://github.com/sauvikdolui/NetworkStatusMonitorPart1", "Repository for Medium Blog", 18, "Swift"]]], ["User", "abdulKarim002", "https://avatars3.githubusercontent.com/u/13949425?v=4", [["activityIndicator", "https://github.com/abdulKarim002/activityIndicator", "Activity Indicator", 51, "Swift"]]], ["User", "varunpm1", "https://avatars2.githubusercontent.com/u/16360897?v=4", [["VPMOTPView", "https://github.com/varunpm1/VPMOTPView", "VPMOTPView is a helper class for displaying OTP (One Time Password) entering view in iOS", 28, "Swift"], ["VPCollectionViewLayout", "https://github.com/varunpm1/VPCollectionViewLayout", "VPCollectionViewLayout is a helper class for displaying collection view cells in different flow layouts. The UI can be customized in different ways", 16, "Swift"]]], ["User", "Albinzr", "https://avatars3.githubusercontent.com/u/7425577?v=4", [["SwiftyTask", "https://github.com/Albinzr/SwiftyTask", "An extreme queuing system with high performance for managing all task in app with closure", 20, "Swift"]]], ["User", "abhiperry", "https://avatars0.githubusercontent.com/u/18373335?v=4", [["ADDatePicker", "https://github.com/abhiperry/ADDatePicker", "A fully customizable iOS Horizontal PickerView library, written in pure swift", 135, "Swift"]]], ["User", "1amageek", "https://avatars2.githubusercontent.com/u/11146538?v=4", [["Bleu", "https://github.com/1amageek/Bleu", "BLE (Bluetooth LE) for U🎁 Bleu is the best in the Bluetooth library.", 472, "Swift"], ["Toolbar", "https://github.com/1amageek/Toolbar", "Awesome autolayout Toolbar. Toolbar is a library for iOS. You can easily create chat InputBar.", 444, "Swift"], ["Pring", "https://github.com/1amageek/Pring", "Cloud Firestore model framework for iOS - Google", 250, "Swift"], ["Sumo", "https://github.com/1amageek/Sumo", "Sumo is a library that prepares for fast upload for iOS. It is effective when uploading by selecting images continuously.", 245, "Swift"], ["Salada", "https://github.com/1amageek/Salada", "Firebase model framework Salada. Salada is the best Firebase framework.", 224, "Swift"], ["Ballcap-iOS", "https://github.com/1amageek/Ballcap-iOS", "Firebase Cloud Firestore support library for iOS. 🧢", 155, "Swift"], ["AssemblyLine", "https://github.com/1amageek/AssemblyLine", "AssemblyLine is a library for easily writing workflows.", 40, "Swift"], ["Muni", "https://github.com/1amageek/Muni", "Chat with Cloud Firestore", 20, "Swift"]]], ["User", "jason-tratta", "https://avatars2.githubusercontent.com/u/191999?v=4", [["ProgressScreen", "https://github.com/jason-tratta/ProgressScreen", "A DEP Enrollment Screen Framework", 86, "Swift"], ["SwiftJSS", "https://github.com/jason-tratta/SwiftJSS", "This is an example on how to leverage JAMFs Casper API using Swift in OS X or iOS", 17, "Swift"]]], ["User", "DeliciousRaspberryPi", "https://avatars0.githubusercontent.com/u/4406172?v=4", [["MockFive", "https://github.com/DeliciousRaspberryPi/MockFive", "A Mocking Framework for Swift Unit Tests", 208, "Swift"]]], ["User", "guoyingtao", "https://avatars0.githubusercontent.com/u/26723384?v=4", [["Mantis", "https://github.com/guoyingtao/Mantis", "A photo cropping tool which mimics Photo.app written by Swift.", 82, "Swift"]]]]}